//==============================================================================
// File		Score.cpp
// Comment	スコアクラス
// Author	Ryo Kobayashi
// Create	2015年3月27日
//==============================================================================

//-----------------------------------------------------------------------------
// インクルードファイル
//-----------------------------------------------------------------------------
#include "Score.h"

// コンストラクタ
CScore::CScore(void)
{

}

// デストラクタ
CScore::~CScore(void)
{

}

// 更新
void CScore::Update(void)
{

}

// 描画
void CScore::Draw(void)
{

}

// スコア設定
void CScore::SetScore(int nScore)
{
	m_nScore = nScore;
}

// EOF