//==============================================================================
// File		SceneDebug.h
// Comment	デバッグ用画面クラス
// Author	TOMOHIRO KOUNO
// Create	2014年7月10日
//==============================================================================

//------------------------------------------------------------------------------
//	インクルードガード
//------------------------------------------------------------------------------
#ifndef _SCENEDEBUG_H_
#define _SCENEDEBUG_H_

//------------------------------------------------------------------------------
//	インクルード
//------------------------------------------------------------------------------
#include "SceneBase.h"

//------------------------------------------------------------------------------
//	前方参照
//------------------------------------------------------------------------------
class CGameObject;

/**
* @brief タイトル画面クラス
*/
class CSceneDebug :public CSceneBase
{
public:
	/**
	* @brief Constructor
	* @param	void
	* @return	void
	*/
	CSceneDebug(void);

	/**
	* @brief Destructor
	*/
	~CSceneDebug(void);

	/**
	*	更新
	*	@param	void
	*	@return	void
	*/
	void Update(void);

	/**
	*	描画
	*	@param	void
	*	@return	void
	*/
	void Draw(void);


private:
};
#endif
//End of File _SCENEDebug_H_