//==============================================================================
// File		SceneClear.cpp
// Comment	クリア画面クラス
// Author	TOMOHIRO KOUNO
// Create	2014年7月10日
//==============================================================================

//------------------------------------------------------------------------------
//	インクルード
//------------------------------------------------------------------------------
#include "SceneClear.h"

/**
*	更新
*	@param	void
*	@return	void
*/
void CSceneClear::Update(void)
{

}

/**
*	描画
*	@param	void
*	@return	void
*/
void CSceneClear::Draw(void)
{

}