//==============================================================================
// File		SceneLogo.h
// Comment	ロゴ画面クラス
// Author	TOMOHIRO KOUNO
// Create	2014年7月10日
//==============================================================================

//------------------------------------------------------------------------------
//	インクルードガード
//------------------------------------------------------------------------------
#ifndef _SCENELOGO_H_
#define _SCENELOGO_H_

//------------------------------------------------------------------------------
//	インクルード
//------------------------------------------------------------------------------
#include "SceneBase.h"

//------------------------------------------------------------------------------
//	前方宣言
//------------------------------------------------------------------------------


/**
* @brief ロゴ画面クラス
*/
class CSceneLogo :public CSceneBase
{
public:
	/**
	* @brief Constructor
	* @param	void
	* @return	void
	*/
	CSceneLogo(void);

	/**
	* @brief Destructor
	*/
	~CSceneLogo(void);

	/**
	*	更新
	*	@param	void
	*	@return	void
	*/
	void Update(void);

	/**
	*	描画
	*	@param	void
	*	@return	void
	*/
	void Draw(void);

private:
	
};
#endif
//End of File _SCENELOGO_H_