//==============================================================================
// File		SceneGameOver.h
// Comment	リザルト画面クラス
// Author	TOMOHIRO KOUNO
// Create	2014年7月10日
//==============================================================================

//------------------------------------------------------------------------------
//	インクルードガード
//------------------------------------------------------------------------------
#ifndef _SCENEGAMEOVER_H_
#define _SCENEGAMEOVER_H_

//------------------------------------------------------------------------------
//	インクルード
//------------------------------------------------------------------------------
#include "SceneBase.h"

//------------------------------------------------------------------------------
//	前方宣言
//------------------------------------------------------------------------------

/**
* @brief リザルト画面クラス
*/
class CSceneGameOver :public CSceneBase
{
public:

	/**
	* @brief Constructor
	* @param	void
	* @return	void
	*/
	CSceneGameOver(void);

	/**
	* @brief Destructor
	*/
	~CSceneGameOver(void);

	/**
	*	更新
	*	@param	void
	*	@return	void
	*/
	void Update(void);

	/**
	*	描画
	*	@param	void
	*	@return	void
	*/
	void Draw(void);

private:

};
#endif
//End of File _SCENEGameOver_H_