//==============================================================================
// File		Object2D.h
// Comment	2Dオブジェクト基底クラス
// Author	TOMOHIRO KOUNO
// Create	2014年12月31日
//==============================================================================

//------------------------------------------------------------------------------
// インクルードガード
//------------------------------------------------------------------------------
#pragma once
#ifndef _OBJECT2D_H_
#define _OBJECT2D_H_

//------------------------------------------------------------------------------
// インクルードファイル
//------------------------------------------------------------------------------
#include "Object2D.h"

class CObject2DHuman
{
public:
	CObject2DHuman(void){}

	~CObject2DHuman(void){}

	virtual void Update(void){}

	virtual void ShaderDraw(void){}

	virtual void Draw(void){}

};
#endif 
//End of File _OBJECT_2D_